app/controllers/products_controller.rb

  def index
    @products = Product.order('id Asc').limit(20)
---
SELECT  `products`.* FROM `products` ORDER BY id Asc LIMIT 20

  def show
    # productsテーブルから該当するidの作品情報を取得し@productの変数へ代入する処理を書いて下さい
    @product = Product.find(params[:id])
---
SELECT  `products`.* FROM `products` WHERE `products`.`id` = 2 LIMIT 1