app/controllers/reviews_controller.rb

SELECT  `products`.* FROM `products` WHERE `products`.`id` = 2 LIMIT 1
---
  def new
    @product = Product.find(params[:product_id])

INSERT INTO `reviews` (`nickname`, `rate`, `review`, `product_id`, `created_at`, `updated_at`) VALUES ('aaaaa', 1, 'xxxxxx', 2, '2019-08-13 07:57:47', '2019-08-13 07:57:47')
---
  def create
    Review.create(create_params)